TRUNCATE TABLE notifications, payments, equipment, contracts, services, subscribers, employees RESTART IDENTITY CASCADE;


INSERT INTO employees (name, role, email, login, password_hash) VALUES
('Админов Админ Админович', 'Администратор', 'admin@provider.com', 'admin', '$2b$12$VmuNGPGW9QP7Ae8.FOU/v.ug8MP.p.NIlhctvxEwlJvrcy6lfuowy'), -- Пароль: admin_pass
('Менеджеров Иван Петрович', 'Менеджер', 'manager@provider.com', 'manager', '$2b$12$Y2tRUjHHBBUGijyAuGFLV.zEbJsJwVcluFAvxLNA.yGqdyXCeOmCm'), -- Пароль: manager_pass
('Техников Сергей Игоревич', 'Технический специалист', 'tech@provider.com', 'tech', '$2b$12$YmAWAJADZSokEUWS8PytH.OXLDQ7xFuLrctgziufnFFPieXsHDTD2');     -- Пароль: tech_pass


INSERT INTO services (name, description, price, status) VALUES
('Интернет Старт 50', 'Домашний интернет на скорости до 50 Мбит/с', 15.00, 'Активна'),
('Интернет Оптима 100', 'Домашний интернет на скорости до 100 Мбит/с', 25.50, 'Активна'),
('Интернет Максимум 200', 'Домашний интернет на скорости до 200 Мбит/с', 35.00, 'Активна'),
('Интернет + ТВ Базовый', 'Интернет 100 Мбит/с и 120 телеканалов', 30.00, 'Активна'),
('Архивный тариф 30', 'Старый тариф на скорости до 30 Мбит/с', 12.00, 'Архивная');



INSERT INTO subscribers (full_name, address, phone_number, password_hash, balance, email, is_confirmed, avatar_url) VALUES ('Иванов Иван Иванович', 'г. Минск, ул. Центральная, д. 1, кв. 5', '+375291112233', '$2b$12$3WGj4v0I1X.SiiSl3juwBuSa4DFLzb07xbTO6FmyTtUX6EoDdBoGO',25.50, 'ivan@ivanov.com', True, 'male1.png');
INSERT INTO subscribers (full_name, address, phone_number, password_hash, balance, avatar_url) VALUES
('Петров Петр Петрович', 'г. Минск, пр. Независимости, д. 10, кв. 12', '+375292223344', '$2b$12$HaDykufYhon.KgKf/qBzQe7PY784kUXobUeLEBgmaJAIzTsZYp3/O',-10.20, 'male2.png'),
('Сидорова Мария Васильевна', 'г. Минск, ул. Якуба Коласа, д. 25, кв. 8', '+375293334455', '$2b$12$HR53Pai4/Pj2epbRYSYY7.nzjz7NQ4P2ktSV08n4jdHioetF5VX3q', 100.00, 'women1.png'),
('Козлов Дмитрий Сергеевич', 'г. Гомель, ул. Советская, д. 50, кв. 3', '+375294445566', '$2b$12$kMmJwkervgdo/GPyBiDs2uIXs1.1JoC4dBCqbftw4.6dERe7yVvAe',0.00, 'male3.png'),
('Новикова Анна Геннадьевна', 'г. Брест, ул. Машерова, д. 5, кв. 1', '+375295556677', '$2b$12$IVa0RTyZCmBXCZvx5Zmibe6BkKXP5aPPFoYoZTDDnqk25fTRXuxwy',5.75, 'women2.png'),
('Васильев Алексей Викторович', 'г. Минск, ул. Сурганова, д. 45, кв. 110', '+375296667788', '$2b$12$uaZwQeT777ccIR8kH870aemmDjKt48qMTZoTg4OYkc96B/lpG5tXW', -25.50, 'male4.png'),
('Зайцева Елена Михайловна', 'г. Минск, ул. Богдановича, д. 78, кв. 42', '+375297778899', '$2b$12$/Fp9lYOwHBdbf0VbaszFVe2P7dHSZrpzTvfhRI.HJo70RRQ9jSUle', 30.00, 'women3.png'),
('Павлов Артем Романович', 'г. Гродно, ул. Ожешко, д. 15, кв. 19', '+375298889900', '$2b$12$M0eXxm1pWCZj5vHQfRakJ.D12C/6JI.eaxlj2YiWfimLgEUECWCfW',50.10, 'male5.png'),
('Романова Светлана Денисовна', 'г. Витебск, пр. Московский, д. 33, кв. 22', '+375299990011', '$2b$12$avl1Y5.wtQVFKDNwFMWGm.CRKPzrJPQnIAbpmouSyQjoYwg535vge', 12.00, 'women4.png'),
('Волков Игорь Станиславович', 'г. Минск, ул. Казинца, д. 120, кв. 301', '+375291122334', '$2b$12$D91w2DFOYvkbjX.aOygCRuB2tYDfpPaWoeCYAGEfYUryXU0iezrUW', 0.00, 'male6.png');

INSERT INTO contracts (subscriber_id, service_id, start_date, status) VALUES
(1, 2, '2022-01-15', 'Активен'),
(2, 1, '2021-11-20', 'Приостановлен'),
(3, 3, '2023-05-10', 'Активен'),
(3, 4, '2023-08-01', 'Активен'),
(4, 2, '2020-02-02', 'Активен'),
(5, 1, '2023-09-01', 'Активен'),
(6, 2, '2022-07-25', 'Приостановлен'),
(7, 4, '2021-06-18', 'Активен'),
(8, 3, '2023-03-12', 'Активен'),
(9, 5, '2019-12-01', 'Расторгнут'),
(10, 2, '2023-10-01', 'Активен');


INSERT INTO equipment (contract_id, type, serial_number, status) VALUES
(1, 'Wi-Fi Роутер', 'TP-LINK_A1B2C3D4', 'У абонента'),
(3, 'Wi-Fi Роутер', 'ZTE_E5F6G7H8', 'У абонента'),
(4, 'ТВ-приставка', 'ZALA_I9J0K1L2', 'У абонента'),
(5, 'Wi-Fi Роутер', 'TP-LINK_M3N4O5P6', 'У абонента'),
(7, 'Wi-Fi Роутер', 'HUAWEI_Q7R8S9T0', 'У абонента'),
(8, 'Wi-Fi Роутер', 'ZTE_U1V2W3X4', 'У абонента'),
(NULL, 'Wi-Fi Роутер', 'TP-LINK_Y5Z6A7B8', 'На складе'),
(NULL, 'Wi-Fi Роутер', 'ZTE_C9D0E1F2', 'На складе'),
(NULL, 'ТВ-приставка', 'ZALA_G3H4I5J6', 'На складе');


INSERT INTO payments (subscriber_id, amount, payment_date, payment_method) VALUES
(1, 25.50, '2025-09-15 10:00:00', 'Банковская карта'),
(1, 25.50, '2025-10-14 11:30:00', 'Онлайн-банк'),
(2, 15.00, '2025-08-20 12:00:00', 'Терминал'),
(2, 15.00, '2025-09-19 14:20:00', 'Банковская карта'),
(3, 50.00, '2025-10-01 09:00:00', 'Онлайн-банк'),
(3, 50.00, '2025-10-05 18:00:00', 'Банковская карта'),
(4, 25.50, '2025-09-02 10:15:00', 'Терминал'),
(4, 25.50, '2025-10-02 11:00:00', 'Онлайн-банк'),
(5, 20.00, '2025-10-01 19:45:00', 'Банковская карта'),
(6, 25.50, '2025-09-05 20:00:00', 'Банковская карта'),
(7, 30.00, '2025-09-18 13:00:00', 'Онлайн-банк'),
(7, 30.00, '2025-10-18 14:00:00', 'Онлайн-банк'),
(8, 100.00, '2025-09-25 15:30:00', 'Банковская карта'),
(9, 12.00, '2024-05-10 12:00:00', 'Терминал');


INSERT INTO notifications (subscriber_id, message, type, sent_date) VALUES
(1, 'Уважаемый абонент! Ваш баланс пополнен на 25.50 BYN.', 'Информационное', '2023-10-14 11:30:05'),
(2, 'Уважаемый абонент! Ваш баланс отрицательный (-10.20 BYN). Пожалуйста, пополните счет для возобновления услуг.', 'Предупреждение о задолженности', '2023-10-01 08:00:00'),
(3, 'Специальное предложение! Подключите вторую услугу со скидкой 50%.', 'Акция', '2023-09-20 12:00:00'),
(5, 'Уважаемый абонент! Напоминаем о необходимости внести абонентскую плату до 1 числа.', 'Информационное', '2023-09-25 09:00:00'),
(6, 'Уважаемый абонент! Предоставление услуг по вашему договору приостановлено в связи с отрицательным балансом.', 'Предупреждение о задолженности', '2023-10-01 00:00:10');